# P 1:
# کدی بنویسید که تعداد رقم های عدد را نشان دهد

# 125 / 10 = 12.5
# 12.5 / 10 = 1.25
# 1.25 / 10 = 0.125
# len = 3

my_number: int = int(input("Please enter a number:"))


# Method 1 :
# print(len(str(my_number)))

# # Method 2 :
# counter: int = 0

# while my_number > 1:
#     my_number = my_number / 10
#     counter += 1

# print(counter)


# P 2: ----------------------------------------------------------------------
# کدی بنویسید که اعداد قبل از عدد را نمایش دهد
# 3 --> 2, 1

# Method 1 : Decreasing
# my_number: int = int(input("Please enter a number:"))

# counter: int = my_number - 1

# while counter > 0:
#     print(counter)
#     counter -= 1


# Method 2 : Increasing

# counter: int = 1

# while counter < my_number:
#     print(counter)
#     counter += 1


# P 3: ----------------------------------------------------------------------
# کدی بنویسید که مجموع ارقام آن را نمایش دهد
# 125 --> 8

# my_number: int = int(input("Please enter a number:"))

# sum: int = 0

# while my_number > 1:
#     my_mod: int = int(my_number % 10)  # 5, 2, 1,
#     my_number = my_number / 10  # 12.5, 1.25, 0.125,
#     sum = sum + my_mod  # 0 + 5, 5 + 2 = 7, 7 + 1 = 8,

# print(sum)

# P 4: ----------------------------------------------------------------------
# یک عدد از کاربر بگیرید و معکوس آن را نمایش دهید
# 125 --> 521

# my_number: int = int(input("Please enter a number:"))  # 125

# reversed_number: int = 0

# while my_number > 1:
#     my_mod: int = int(my_number % 10)  # 5, 2, 1,
#     reversed_number = (reversed_number * 10) + my_mod  # 5, 52, 521
#     my_number = my_number / 10  # 12.5, 1.25, 0.125

# print(reversed_number)


# P 5: ----------------------------------------------------------------------
# برنامه ای که اعداد زوج 10 تا 100 را نشان دهد
# 10, 12, 14, ...

# P 6: ----------------------------------------------------------------------
# برنامه ای که مقسوک علیه عدد وررودی را نشان دهد
# 12 --> 1, 2, 3, 4, 6, 12

# P 7: ----------------------------------------------------------------------
# برنامه ای که مقدار ماکس و مین و میانگین را نشان دهد
# 1, 2, 3 --> min=1, max=3, avg=2
num1, num2, num3 = 12, 17, 23  # -> min=12, max=23, avg=20.666


# P 8: ----------------------------------------------------------------------
# یک عدد از کاربر بگیزید و فاکتوریل آن را نشان دهید
# 5! -> 125


# P 9: ----------------------------------------------------------------------
# از 10 تا 100, 10 تا 10 تا نشان دهید
# 10, 20, 30, 40, ..


# P 10: ----------------------------------------------------------------------
# یک عدد از کاربر بگیرید و 10 تا 10 تا, تا عدد ورودی نشان دهید
#  50 -> 10, 20, 30, 40, 50
